<template>
  <div class="hello">
    <div class="header">project of 顺顺利利队</div>
    <div class="content">
      <div class="box">
        <h2>Team Info</h2>
        <p>
          队名：顺顺利利队，团队成员有魏新蕾、陈善文、魏玉林，日常通过会议或群聊进行沟通讨论，根据成员擅长进行项目的分工
        </p>
      </div>
      <div class="box">
        <h2>Project Proposal</h2>
        <p>
          我们计划的项目目标是通过对用户相关健康数据的统计与分析，设计一款为用户提供个性化运动/饮食/睡眠等方面的建议，从而达到帮助用户提高生活体验的应用软件，包括但不限于运动健身类型及时间方面的建议、食物热量计算及饮食推荐、睡眠时间提醒及助眠工具等。
        </p>
      </div>
      <div class="box">
        <h2>Data collection plan: interview</h2>
        <div :style="isPhone ? {} : { display: 'flex' }">
          <div
            class="interview"
            :style="
              isPhone
                ? { borderBottom: '2px solid rgb(235, 235, 235)' }
                : {
                    borderRight: '2px solid rgb(235, 235, 235)',
                    width: '200%',
                  }
            "
          >
            <h3>question</h3>
            <h4>主题一：用户运动、健康、睡眠现状</h4>
            <p>1.您认为运动健身重要吗？会对自身起到什么帮助或改变吗？</p>
            <p>
              2.您现在有运动健身的习惯吗？大概一周几次呢？每次的运动时间有留意过吗？
            </p>
            <p>
              3.您在日常饮食中有关注过食物的热量吗？如果有的话，会刻意控制自己的饮食热量吗？
            </p>
            <p>
              4.您现在有想要调节自己饮食习惯的想法吗？有做出什么行为去调节吗？如果有的话，是想要朝哪个方向调整呢？例如时间、饮食量等
            </p>
            <p>
              5.您现在有睡眠不足或失眠方面的困扰吗？有尝试过借助助眠音乐或药物等其他方式改善吗？
            </p>

            <h4>主题二：用户对这类软件的了解和使用情况</h4>

            <p>1.您使用过运动健康app吗？使用的频率高吗？</p>
            <p>
              2.您认为这类软件最重要的功能是什么？对您的生活质量有没有改善？
            </p>
            <p>
              3.您对app采集的健康数据关心吗？您认为这类app采集的信息准确吗？
            </p>
            <p>4.您使用过哪些运动健康app？您最满意的运动健康app是什么？</p>
            <p>5.您对运动健康app有什么更好的期待？希望增加哪些功能？</p>

            <h4>主题三：如果用户使用这类软件，希望软件提供哪些主要功能</h4>
            <p>1. 您对大部分运动健康app感到满意吗？</p>
            <p>2. 您感觉运动健康app有什么共同的缺点吗，您希望如何改善？</p>
            <p>
              3. 您对运动健康app 操作界面有要求吗，现在运动健康 app
              操作界面能满足您运动时的需求吗？
            </p>
            <p>4. 您运动时喜欢佩戴穿戴式运动设备来采集吗?</p>
            <p>
              5.
              您对穿戴式运动设备比如运动手环的功能还有什么要求吗？您希望它还要具有什么功能？
            </p>
          </div>
          <div class="answer" :style="isPhone ? {} : { maxHeight: '950px' }">
            <h3>answer</h3>
            <div class="person">
              <h4>person 1:</h4>
              <p style="font-weight: 500">主题一：</p>
              <p>
                1. 重要，个人认为健身是一项很不错的运动，可以提高我的身体素质
              </p>
              <p>
                2.
                虽然才进入这个行业，之前也没有做过系统的健身训练，只是在下班有兴致的时候去跑步机跑跑
                步。有时候上班做图太多，下班后只想休息。但是感觉自己的身体状态越来越差了，是时候规划一
                下自己的训练计划了。
              </p>
              <p>3. 有，经常会</p>
              <p>
                4.
                我吃东西会先看配料表，还有营养成分表。热量是次要的，或者说是不重要的。至于食物的冷热寒
                凉性，女生会考虑的多一点吧，尤其是姨妈期，确实要少食辛辣寒凉，我觉得各种食物营养均衡即
                可，不必走极端，例如：榴莲热量高糖分高，有些人就一棒子打死说不能吃，其实不然，榴莲是非
                常有营养价值的一种水果。
              </p>
              <p>5. 没有</p>
              <p style="font-weight: 500">主题二：</p>
              <p>1. 使用过，几乎每天都用，主要是睡觉和运动的时候用</p>
              <p>
                2.
                记录睡眠质量，包括入睡时间，睡眠时长，深度睡眠时常等；记录心率，查看心脏的健康；记录运
                动，包括运动时间，距离，以及运动时候的心率；对于生活质量的改善不好说，但是会对自己更了
                解，比如知道了自己昨晚的睡眠时长，如果深睡时间短的话，会在白天再补补觉；运动的时候会比
                较关心心率，根据心率调整跑步的频率，尽量把心率维持在一个合理的区间
              </p>
              <p>
                3.
                比较关心，因为可以对自己的生活有一个更精确的了解；我举得信息采集还可以，比较准确，因为
                我在网上看过对比视频，运动手表的心率测量效果和心率带以及专业的心率采集设备差不多，误差
                在10以内，我觉得就还可以；睡眠时间也比较准确，深度睡眠时间就不太确定了，不知道自己深度
                睡眠是怎么衡量的，不过有时候早上起来感觉很有精神，一般深度睡眠会比较长，所以我觉得智能
                手表记录的还比较准确
              </p>
              <p>
                4. 小米运动健康
                hayloufun，华为运动健康，我觉得小米的界面做的不错，很多可视化的效果比较
                好，比起纯文字要直观很多，也有交互，可以查看更详细的数据。
              </p>
              <p>
                5. 我觉得现在的APP 用起来已经比较方便了，有一点小意见是
                数据同步，跟智能手表的数据同步有 时候有一点慢，希望能改进一下
              </p>
              <p style="font-weight: 500">主题三：</p>

              <p>1. 挺满意的，现在的运动app花样很多，能满足我很多要求</p>
              <p>
                2. 我感觉 app
                有各自的优点和缺点，他们都是互补的，共同的缺点不太多
              </p>
              <p>3.没有，可以满足</p>
              <p>4.喜欢</p>
              <p>
                5.希望可以记录步数，心率，运动速率，睡眠监测，卡路里消耗等信息，要求可以实现睡眠监测，记录
                卡路里消耗等信息；还希望它可以具有分阶段根据运动时间推荐运动速率的模式等
              </p>
            </div>
            <div class="person">
              <h4>person 2:</h4>
              <p style="font-weight: 500">主题一：</p>
              <p>
                1.
                重要，可以让我更自信，自信。当每次在体育场，健身房，甚至走在路上，别人看到你健硕的肌
                肉，提拔的身姿，稳健而有力的步伐，强大的气场时，都会投向羡慕的目光，经常有朋友向我咨询
                健身方面的知识，在这不经意间，你会发现自己的价值观和存在感，至少在每次聚会聊天中有能拿
                出手的东西，慢慢的自我肯定和认同，就会升华成一种由内而外的自信。当然，对于一个男人来
                说，自信无疑是最重要的，当你自信的面对一切时候，你做事情经常可以游刃有余，就像马太效应
                那样，越自信越优秀，感觉越来越好。
              </p>
              <p>
                2.
                两天一练吧，每天都练我每天都会很累，但是两天一练我每天都很有精神
              </p>
              <p>3. 没有哦</p>
              <p>4. 只是不喝碳酸饮料</p>
              <p>5. 没有，因为锻炼的缘故现在精神状态挺好的</p>
              <p style="font-weight: 500">主题二：</p>
              <p>1. 没有用过</p>
              <p>2. 教大家一些运动的技巧吧</p>
              <p>3. 没用过，不了解</p>
              <p>4. 没用过，不了解</p>
              <p>5. 没用过，不了解</p>
              <p style="font-weight: 500">主题三：</p>

              <p>1. 没用过，不了解</p>
              <p>2. 没用过，不了解</p>
              <p>3.没用过，不了解</p>
              <p>4.没用过，不了解</p>
              <p>5.没用过，不了解</p>
            </div>
            <div class="person">
              <h4>person 3:</h4>
              <p style="font-weight: 500">主题一：</p>
              <p>
                1.
                重要，可以让我心态变好，一个热爱运动的人绝对心态不会差。运动释放人的负能量，吸收正能
                量，你会发现，运动带给你的心态变化，你学会忍耐。学会坚持，学会不抱怨，学会去一个人相
                处，学会勇敢面对。
              </p>
              <p>
                2.
                有，每周超过10小时的锻炼也会损失一些锻炼的好处，所以我每周锻炼十个小时，次数不固定
              </p>
              <p>3. 有，经常会</p>
              <p>
                4.
                有段时间我减肥，那段时间我每天一餐，只吃中餐，我知道这样可能对身体有一定程度的影响，但
                还是坚持下来了
              </p>
              <p>5. 偶尔会，我一般会起来看会手机</p>
              <p style="font-weight: 500">主题二：</p>
              <p>1. 曾经用过，但是感觉没什么用，现在就不用了</p>
              <p>
                2.
                记步数，一些教运动技巧的视频以及教你如何饮食等，但是我感觉好好跑步好好吃饭就行了，这么
                多限制反而感觉不舒服
              </p>
              <p>3. 关心，数据这个东西准确了才有用，不准确反而有害</p>
              <p>4. 我就用过keep，感觉做的挺不错的</p>
              <p>5. 我现在还没感觉出来哪里不好，如果能做的更好那就更好了</p>
              <p style="font-weight: 500">主题三：</p>

              <p>1.我感觉这些东西作用有限，主要还是靠自己坚持锻炼</p>
              <p>2. 这些东西用起来太不方便，我更倾向于什么都不戴</p>
              <p>3.不太能满足，使用起来太麻烦</p>
              <p>4.不喜欢</p>
              <p>
                5.还希望它可以可搜索定位、具有分阶段根据运动时间推荐运动速率的模式等
              </p>
            </div>
            <div class="person">
              <h4>person 4:</h4>
              <p style="font-weight: 500">主题一：</p>
              <p>
                1.
                重要，我想，能够去健身的人士，不管其他方面咋样，至少是一个生活积极向上的，对自我要求较
                高的人，当然这样的人在其他方面通常也不差，天天接触这样的人应该比在游戏场，寝室宿舍接触
                的人更好。时间久了，自然一个人也变得积极努力多了。物以类聚，人以群分。
              </p>
              <p>2. 会，我在减肥，可以有氧运动多一点，每两天跑一次步</p>
              <p>3. 有，经常会</p>
              <p>4. 晚上只吃水果</p>
              <p>
                5.
                现在还好，以前经常失眠，我换了个枕头，每天都用热水泡脚，就改善了很多
              </p>
              <p style="font-weight: 500">主题二：</p>
              <p>1. 会用，在做有氧运动的时候会拿来记步数</p>
              <p>2. 我就是用它来记步数，改善还是有的，但是不大</p>
              <p>
                3.
                关心，我可以根据这些数据来调整我的运动，对我运动改善还是挺大的
              </p>
              <p>
                4. 用过的挺多的，keep，点点运动，咕噜运动这些，感觉keep做的更好
              </p>
              <p>
                5.
                还是页面要做的更简洁好操作一点吧，因为运动起来操控手机就没那么容易了
              </p>
              <p style="font-weight: 500">主题三：</p>
              <p>1.满意</p>
              <p>
                2.
                页面不够简单吧，比如我跑起来的时候想要按哪个按键可能会按错，把页面调的大一些然后简洁一
                些就行了
              </p>
              <p>3.页面做的简单一些就行了</p>
              <p>4.喜欢</p>
              <p>
                5.可以跟keep等运动软件绑定，要求可以记录步数、睡眠时间、卡路里消耗等功能；还希望它可以实
                现与其他用户的连线运动pk
              </p>
            </div>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>

<script setup>
import { onMounted, ref } from 'vue';
function is_Phone() {
  return /(iPhone|iPad|iPod|iOS|Android)/i.test(navigator.userAgent);
}

var isPhone = ref(false);
onMounted(() => {
  isPhone.value = is_Phone();
  console.log('222', isPhone.value);
});
</script>

<style scoped>
.hello {
  display: flex;
  flex-direction: column;
}
.header {
  position: fixed;
  top: 0;
  width: 100%;
  height: 100px;
  line-height: 100px;
  background-color: #fff;
  border-bottom: 1px solid rgb(218, 216, 216);
  padding-left: 50px;
  font-size: 24px;
  font-weight: 500;
}
.content {
  padding-top: 100px;
  display: flex;
  flex-direction: column;
  align-items: center;
}
.box {
  max-height: 5500px;
  width: 95%;
  background-color: #fff;
  margin: 10px 0 20px 0;
  box-sizing: border-box;
}
.box h2 {
  padding: 0 0 20px 20px;
  border-bottom: 2px solid rgb(235, 235, 235);
  margin-bottom: 0;
}
.box p {
  padding: 0 10px 0 20px;
}
.interview,
.answer {
  padding: 0 20px 10px 20px;
  overflow: auto;
}
</style>
